Ruby on Rails Experience/rails-team-nodes-project-master/app/controllers/page_controller.rb

  def index
    @products = Product.all
    @product_images = ProductImage.all
---
SELECT "products".* FROM "products"
SELECT "product_images".* FROM "product_images" WHERE "product_images"."product_id" = ? ORDER BY "product_images"."id" ASC LIMIT ?  [["product_id", 204], ["LIMIT", 1]]