Ruby on Rails Experience/rails-team-nodes-project-master/app/controllers/products_controller.rb

  def index
    # @products = Product.all
    @products = Product.order(:name).page params[:page]
---
SELECT "products".* FROM "products" ORDER BY "products"."name" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"