Ruby on Rails Experience/rails-team-nodes-project-master/app/views/products/show.html.erb

        <div class="col-md-4 mt-3 mb-3">
          <% if (@product.product_images.count < 4)%>
---
SELECT "product_images".* FROM "product_images" WHERE "product_images"."product_id" = ?  [["product_id", 268]]
SELECT COUNT(*) FROM "product_images" WHERE "product_images"."product_id" = ?  [["product_id", 268]]

            <div class="media-area">
              <h3 class="title text-center"><%= pluralize((@product.questions.size - 1), "Question") %></h3>
---
SELECT COUNT(*) FROM "questions" WHERE "questions"."product_id" = ?  [["product_id", 268]]